{
   "id": "angels",
   "title": "Les Anges (Al-Mala'ika)",
   "description": "Créatures célestes créées par Allah à partir de lumière, chargées d’exécuter Ses ordres avec une obéissance parfaite. Les anges n’ont pas de libre arbitre et glorifient Allah sans cesse. Ils jouent divers rôles : messagers, gardiens, scribes, ou exécutants des décrets divins. Le Prophète ﷺ a dit : « Les anges ont été créés de lumière, les djinns de feu sans fumée, et Adam d’argile. »",
   "imageUrl": "images/mosquee9.jpg",
   "quranVerses": [
    {
     "ar": "وَمَنْ عِنْدَهُ مَلَائِكَةٌ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ",
     "fr": "Et auprès de Lui des anges qui ne s’enorgueillissent pas de L’adorer et ne se lassent jamais.",
     "surah": "Al-Anbiya",
     "ayah": "19-20"
    },
    {
     "ar": "الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ",
     "fr": "Louange à Allah, Créateur des cieux et de la terre, qui a fait des anges des messagers dotés d’ailes, deux, trois ou quatre.",
     "surah": "Fatir",
     "ayah": "1"
    }
   ],
   "hadiths": [
    {
     "ar": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ ﷺ: خُلِقَتِ الْمَلَائِكَةُ مِنْ نُورٍ وَخُلِقَ الْجَانُّ مِنْ مَارِجٍ مِنْ نَارٍ وَخُلِقَ آدَمُ مِمَّا وُصِفَ لَكُمْ",
     "fr": "D’après Aïcha (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Les anges ont été créés de lumière, les djinns d’une flamme de feu sans fumée, et Adam de ce qui vous a été décrit (argile). »",
     "narrator": "Sahih Muslim"
    }
   ],
   "children": [
    {
     "id": "jibril",
     "title": "Jibril (Gabriel)",
     "description": "Ange chargé de transmettre les révélations divines aux prophètes. Jibril est le plus éminent des anges, surnommé l’Esprit fidèle (Ar-Ruh al-Amin). Il a apporté le Coran au Prophète Muhammad ﷺ sur une période de 23 ans, et il est apparu sous forme humaine lors de la célèbre rencontre avec les compagnons pour enseigner les bases de la foi.",
     "imageUrl": "images/mosquee7.jpeg",
     "quranVerses": [
      {
       "ar": "نَزَلَ بِهِ الرُّوحُ الْأَمِينُ ۝ عَلَىٰ قَلْبِكَ لِتَكُونَ مِنَ الْمُنْذِرِينَ",
       "fr": "L’Esprit fidèle l’a fait descendre sur ton cœur afin que tu sois parmi les avertisseurs.",
       "surah": "Ash-Shu’ara",
       "ayah": "193-194"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ ﷺ إِذْ جَاءَ رَجُلٌ فَسَأَلَهُ عَنِ الْإِيمَانِ وَالْإِسْلَامِ وَالْإِحْسَانِ، ثُمَّ قَالَ: ذَاكَ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ",
       "fr": "D’après Umar ibn al-Khattab (qu’Allah l’agrée), il dit : « Alors que nous étions auprès du Messager d’Allah (ﷺ), un homme vint et lui demanda ce qu’étaient la foi, l’islam et l’excellence. Puis il dit : C’était Jibril, venu vous enseigner votre religion. »",
       "narrator": "Sahih Muslim"
      }
     ],
     "children": [
      {
       "id": "revelation",
       "title": "La Révélation",
       "description": "Jibril a transmis le Coran au Prophète Muhammad ﷺ pendant 23 ans. La première révélation a eu lieu dans la grotte de Hira, marquant le début de la mission prophétique.",
       "imageUrl": "images/"
      },
      {
       "id": "role-in-other-religions",
       "title": "Rôle dans les autres religions",
       "description": "Jibril est également mentionné dans la Bible et la Torah comme l’ange Gabriel, messager de Dieu, notamment annonçant la naissance de Jésus à Marie.",
       "imageUrl": "images/"
      }
     ]
    },
    {
     "id": "mikail",
     "title": "Mikail (Michel)",
     "description": "Ange responsable de la distribution des provisions et de la pluie, apportant la miséricorde d’Allah à la Terre. Il est souvent associé aux bénédictions naturelles comme les précipitations et la fertilité.",
     "imageUrl": "images/mosquee6.jpeg",
     "quranVerses": [
      {
       "ar": "وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ",
       "fr": "Et Nous avons fait descendre du ciel une eau avec laquelle Nous avons fait pousser toutes sortes de couples magnifiques.",
       "surah": "Luqman",
       "ayah": "10"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا وَمَلَكَانِ يَنْزِلَانِ، فَيَقُولُ أَحَدُهُمَا: اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا، وَيَقُولُ الْآخَرُ: اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا",
       "fr": "D’après Abu Hurayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Chaque jour, deux anges descendent ; l’un dit : Ô Allah, donne une compensation à celui qui dépense ; l’autre dit : Ô Allah, donne la ruine à celui qui retient. » (Mikail est souvent lié à ces bénédictions).",
       "narrator": "Sahih Al-Bukhari"
      }
     ]
    },
    {
     "id": "israfil",
     "title": "Israfil",
     "description": "Ange chargé de souffler dans la Trompette (As-Sur) pour annoncer la fin des temps et la Résurrection. Il est prêt depuis la création, attendant l’ordre d’Allah.",
     "imageUrl": "images/mosquee7.webp",
     "quranVerses": [
      {
       "ar": "فَإِذَا نُفِخَ فِي الصُّورِ نَفْخَةٌ وَاحِدَةٌ ۝ وَحُمِلَتِ الْأَرْضُ وَالْجِبَالُ فَدُكَّتَا دَكَّةً وَاحِدَةً",
       "fr": "Et lorsque l’on soufflera dans la Trompette d’un seul souffle, et que la terre et les montagnes seront soulevées puis pulvérisées d’un seul coup.",
       "surah": "Al-Haqqah",
       "ayah": "13-14"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: كَيْفَ أَنْعَمُ وَصَاحِبُ الصُّورِ قَدْ أَخَذَ الصُّورَ وَحَنَى جَبْهَتَهُ يَنْتَظِرُ أَنْ يُؤْمَرَ فَيَنْفُخَ",
       "fr": "D’après Abu Sa’id al-Khudri (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Comment pourrais-je me reposer alors que le porteur de la Trompette a pris la Trompette, a incliné son front, et attend l’ordre de souffler ? »",
       "narrator": "Sunan At-Tirmidhi"
      }
     ]
    },
    {
     "id": "azrael",
     "title": "Azrael",
     "description": "Ange de la mort, chargé par Allah de reprendre les âmes au moment fixé. Il est connu dans la tradition comme Malak al-Mawt, exécutant le décret divin avec précision.",
     "imageUrl": "images/mosquee8.jpg",
     "quranVerses": [
      {
       "ar": "قُلْ يَتَوَفَّاكُمْ مَلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
       "fr": "Dis : « L’ange de la mort, qui a été chargé de vous, vous rappellera, puis vous serez ramenés à votre Seigneur. »",
       "surah": "As-Sajdah",
       "ayah": "11"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنِ الْبَرَاءِ بْنِ عَازِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِذَا جَلَسَ الْمُؤْمِنُ فِي قَبْرِهِ أَتَاهُ مَلَكُ الْمَوْتِ",
       "fr": "D’après Al-Bara’ ibn Azib (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Lorsque le croyant est assis dans sa tombe, l’ange de la mort vient à lui. » (Contexte élargi dans le hadith).",
       "narrator": "Sahih Al-Bukhari"
      }
     ]
    },
    {
     "id": "guardian-angels",
     "title": "Les Anges Gardiens",
     "description": "Anges chargés de protéger les humains tout au long de leur vie.",
     "imageUrl": "images/mosquee7.jpg",
     "quranVerses": [
      {
       "ar": "لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ",
       "fr": "Il a des anges qui se relaient devant et derrière lui, et qui le protègent par ordre d'Allah.",
       "surah": "Ar-Ra'd",
       "ayah": "11"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ لِكُلِّ إِنْسَانٍ مَلَكَيْنِ يَحْفَظَانِهِ",
       "fr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit : « Chaque être humain a deux anges qui le protègent. »",
       "narrator": "Al-Bukhari"
      }
     ]
    },
    {
     "id": "rain-angels",
     "title": "Les Anges de la Pluie",
     "description": "Anges chargés de distribuer l'eau et les provisions sur Terre.",
     "imageUrl": "images/mecque5.jpeg",
     "quranVerses": [
      {
       "ar": "وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَسْكَنَّاهُ فِي الْأَرْضِ",
       "fr": "Et Nous avons fait descendre du ciel une eau avec mesure, puis Nous l'avons fait séjourner dans la terre.",
       "surah": "Al-Mu'minun",
       "ayah": "18"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ الْمَاءَ يَنْزِلُ بِأَمْرِ اللَّهِ وَمَعَهُ مَلَائِكَةٌ",
       "fr": "D'après Abu Hurayra (qu'Allah l'agrée), le Messager d'Allah (ﷺ) a dit : « L'eau descend par ordre d'Allah, accompagnée d'anges. »",
       "narrator": "Muslim"
      }
     ]
    }
   ]
  }