  {
   "id": "jinns",
   "title": "Les Djinns (Al-Jinn)",
   "description": "Créatures invisibles créées à partir d’une flamme de feu sans fumée, dotées de libre arbitre comme les humains. Certains djinns sont croyants et obéissent à Allah, tandis que d’autres, comme Iblis, se rebellent. Le Coran mentionne une délégation de djinns ayant entendu la récitation du Prophète ﷺ et cru en lui.",
   "imageUrl": "images/mecque1.jpeg",
   "quranVerses": [
    {
     "ar": "وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ",
     "fr": "Et Il a créé les djinns d’une flamme de feu sans fumée.",
     "surah": "Ar-Rahman",
     "ayah": "15"
    },
    {
     "ar": "قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا",
     "fr": "Dis : « Il m’a été révélé qu’un groupe de djinns a écouté, puis ils ont dit : Nous avons entendu un Coran merveilleux. »",
     "surah": "Al-Jinn",
     "ayah": "1"
    }
   ],
   "hadiths": [
    {
     "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: خُلِقَتِ الْجِنُّ مِنْ نَارٍ",
     "fr": "D’après Abu Hurayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Les djinns ont été créés de feu. »",
     "narrator": "Muslim"
    },
    {
     "ar": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ النَّبِيُّ ﷺ يَقْرَأُ الْقُرْآنَ فَاسْتَمَعَ إِلَيْهِ نَفَرٌ مِنَ الْجِنِّ فَآمَنُوا",
     "fr": "D’après Ibn Abbas (qu’Allah les agrée), le Prophète (ﷺ) récitait le Coran, et un groupe de djinns l’a écouté et a cru.",
     "narrator": "Sahih Al-Bukhari"
    }
   ],
   "children": [
    {
     "id": "iblis",
     "title": "Iblis (Satan)",
     "description": "Chef des djinns rebelles, maudit par Allah pour avoir refusé de se prosterner devant Adam par orgueil. Il est l’ennemi juré de l’humanité, cherchant à égarer les fils d’Adam jusqu’au Jour du Jugement.",
     "imageUrl": "images/",
     "quranVerses": [
      {
       "ar": "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ",
       "fr": "Et lorsque Nous avons dit aux anges : « Prosternez-vous devant Adam », ils se prosternèrent, sauf Iblis, qui était parmi les djinns.",
       "surah": "Al-Kahf",
       "ayah": "50"
      },
      {
       "ar": "قَالَ رَبِّ بِمَا أَغْوَيْتَنِي لَأُزَيِّنَنَّ لَهُمْ فِي الْأَرْضِ وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
       "fr": "Il dit : « Ô Seigneur, parce que Tu m’as égaré, je leur embellirai certes les choses sur la terre et je les égarerai tous. »",
       "surah": "Al-Hijr",
       "ayah": "39"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى الْمَاءِ ثُمَّ يَبْعَثُ سَرَايَاهُ",
       "fr": "D’après Abu Hurayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Iblis place son trône sur l’eau et envoie ses armées. »",
       "narrator": "Sahih Muslim"
      }
     ]
    },
    {
     "id": "believing-jinns",
     "title": "Djinns croyants",
     "description": "Djinns qui ont embrassé l’Islam et servent Allah. Une délégation de djinns a entendu le Coran récité par le Prophète ﷺ et s’est convertie, appelant leur peuple à la foi.",
     "imageUrl": "images/",
     "quranVerses": [
      {
       "ar": "وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ",
       "fr": "Et parmi nous, il y a des musulmans et d’autres qui s’écartent du droit chemin.",
       "surah": "Al-Jinn",
       "ayah": "14"
      }
     ],
     "hadiths": [
      {
       "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ مِنَ الْجِنِّ مَنْ آمَنَ بِي",
       "fr": "D’après Abu Hurayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « Parmi les djinns, il en est qui ont cru en moi. »",
       "narrator": "Muslim"
      }
     ]
    },
    {
     "id": "non-believing-jinns",
     "title": "Djinns non-croyants",
     "description": "Djinns qui ont rejeté l'Islam et suivent Iblis.",
     "imageUrl": "images/"
    },
    {
     "id": "builder-jinns",
     "title": "Djinns constructeurs",
     "description": "Djinns qui ont construit des monuments pour Sulayman (Salomon).",
     "imageUrl": "images/"
    }
   ]
  }