{
  "id": "eau",
 "title": "L'Eau (Al-Ma')",
 "description": "Premier élément de la création divine, mentionné dans le hadith et le Coran. L'eau est citée plus de 60 fois dans le Coran, soulignant son importance fondamentale comme source de vie et signe de la puissance d’Allah. Allah utilise l’eau pour faire pousser les plantes, abreuver les créatures et manifester Sa miséricorde. Le Prophète ﷺ a dit que l’eau était la première chose créée, base de toute existence.",
 "imageUrl": "images/mekka.webp",
 "quranVerses": [
  {
   "ar": "وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ",
   "fr": "Et Nous avons créé, à partir de l’eau, toute chose vivante.",
   "surah": "Al-Anbiya",
   "ayah": "30"
  },
  {
   "ar": "وَهُوَ الَّذِي أَرْسَلَ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا",
   "fr": "Et c’est Lui qui envoie les vents comme une annonce de Sa miséricorde. Puis, Nous faisons descendre du ciel une eau pure.",
   "surah": "Al-Furqan",
   "ayah": "48"
  },
  {
   "ar": "وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَسْكَنَّاهُ فِي الْأَرْضِ ۖ وَإِنَّا عَلَىٰ ذَهَابٍ بِهِ لَقَادِرُونَ",
   "fr": "Et Nous avons fait descendre du ciel une eau avec mesure, puis Nous l’avons fait séjourner dans la terre. Et Nous sommes Capable de la faire disparaître.",
   "surah": "Al-Mu’minun",
   "ayah": "18"
  },
  {
   "ar": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُخْتَلِفًا أَلْوَانُهَا",
   "fr": "N’as-tu pas vu qu’Allah fait descendre du ciel une eau avec laquelle Nous faisons sortir des fruits de couleurs variées ?",
   "surah": "Fatir",
   "ayah": "27"
  }
 ],
 "hadiths": [
  {
   "ar": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ الْمَاءَ طَهُورٌ لَا يُنَجِّسُهُ شَيْءٌ",
   "fr": "D’après Abu Hurayra (qu’Allah l’agrée), le Messager d’Allah (ﷺ) a dit : « L’eau est pure et rien ne la rend impure. »",
   "narrator": "At-Tirmidhi"
  },
  {
   "ar": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: خُلِقَتِ الْمَاءُ قَبْلَ كُلِّ شَيْءٍ",
   "fr": "D’après Abdullah ibn Umar (qu’Allah les agrée), le Messager d’Allah (ﷺ) a dit : « L’eau a été créée avant toute chose. »",
   "narrator": "Musnad Ahmad"
  }
 ],
 "children": [
    { "$ref": "eau_children/heavens_earth.json" },
    { "$ref": "eau_children/angels.json" },
    { "$ref": "eau_children/jinns.json" },
    { "$ref": "eau_children/humans.json" },
    { "$ref": "eau_children/seven_earths.json" }
  ]
}